In [26]:
 import pandas as pd

In [27]:
names = ['Abhishek','Shubham','Rohit','Himanshu','Varun','Neha','Asha','Vandana']

In [28]:
gender = ['Male','Male','Male','Male','Male','Female','Female','Female']

In [29]:
city = ['Delhi','Gurgaon','Newyork','Chennai','Lucknow','Jalandhar','Karnal','Gurgaon']

In [30]:
employee_dict = {
    'Name' : names,
    'Gender' : gender,
    'City' : city
}

In [31]:
import pandas as pd
dataFrame = pd.DataFrame(employee_dict)
dataFrame

       Name  Gender       City
0  Abhishek    Male      Delhi
1   Shubham    Male    Gurgaon
2     Rohit    Male    Newyork
3  Himanshu    Male    Chennai
4     Varun    Male    Lucknow
5      Neha  Female  Jalandhar
6      Asha  Female     Karnal
7   Vandana  Female    Gurgaon

In [32]:
'''
Data type in pandas

1. int64
2. float64
3. bool
4. object (for string)

'''
dataFrame.dtypes

Name      object
Gender    object
City      object
dtype: object

In [33]:
dataFrame.head() #First 5 Rows

       Name Gender     City
0  Abhishek   Male    Delhi
1   Shubham   Male  Gurgaon
2     Rohit   Male  Newyork
3  Himanshu   Male  Chennai
4     Varun   Male  Lucknow

In [34]:
dataFrame.tail()

       Name  Gender       City
3  Himanshu    Male    Chennai
4     Varun    Male    Lucknow
5      Neha  Female  Jalandhar
6      Asha  Female     Karnal
7   Vandana  Female    Gurgaon

In [35]:
dataFrame.head(2)

       Name Gender     City
0  Abhishek   Male    Delhi
1   Shubham   Male  Gurgaon

In [36]:
dataFrame['Name']  #This is series (One coloumn at a time)

0    Abhishek
1     Shubham
2       Rohit
3    Himanshu
4       Varun
5        Neha
6        Asha
7     Vandana
Name: Name, dtype: object

In [37]:
dataFrame[['Name','Gender']].head()

       Name Gender
0  Abhishek   Male
1   Shubham   Male
2     Rohit   Male
3  Himanshu   Male
4     Varun   Male

In [38]:
dataFrame['Name'][dataFrame['City'] == 'Gurgaon']

1    Shubham
7    Vandana
Name: Name, dtype: object

In [39]:
dataFrame['Name'][(dataFrame['City'] == 'Gurgaon') & (dataFrame['Gender'] == 'Male')]  #Return type is series for a single column

1    Shubham
Name: Name, dtype: object

In [40]:
dataFrame['Name'][(dataFrame['City'] == 'Gurgaon') | (dataFrame['Gender'] == 'Male')]

0    Abhishek
1     Shubham
2       Rohit
3    Himanshu
4       Varun
7     Vandana
Name: Name, dtype: object